read_verilog ..\rtl\rtl_alu.v
synth -top alu
stat
write_verilog alu_netlist.v
